-- 备用导入文件，弹窗UI的最新内容
--
-- 表的结构 `fcm_ui_config`
--

CREATE TABLE `fcm_ui_config` (
  `id` int(10) NOT NULL,
  `group` int(1) NOT NULL DEFAULT '1' COMMENT '文案分组 1-线上版 2-版署版',
  `type` int(3) NOT NULL DEFAULT '1' COMMENT 'ui类型:1-宵禁剩余时间提示 2-时长剩余提示 3-单笔消费限制 4-月消费限制 5-已经处于宵禁提示 6-时长耗尽提示7-登陆提示',
  `account_type` int(1) NOT NULL DEFAULT '1' COMMENT '0-未实名游客 1：8岁以下 ，2：8-15岁，  3：16-17岁， 4：18+ 5：未实名正式用户',
  `title` varchar(255) NOT NULL DEFAULT '' COMMENT '对话框标题 eg:健康消费提示',
  `description` varchar(1024) NOT NULL DEFAULT '' COMMENT '对话框内容 eg:老板你已经氪了一座金山，请冷静',
  `update_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '更新时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 转存表中的数据 `fcm_ui_config`
--

INSERT INTO `fcm_ui_config` (`id`, `group`, `type`, `account_type`, `title`, `description`, `update_time`) VALUES
(1, 1, 3, 1, '健康消费提示', '根据国家相关规定，当前您无法使用充值相关功能。', '2020-07-23 15:49:37'),
(2, 1, 3, 2, '健康消费提示', '根据国家相关规定，您本次付费金额超过规定上限，无法购买。请适度娱乐，理性消费。', '2020-07-23 15:49:38'),
(3, 1, 3, 3, '健康消费提示', '根据国家相关规定，您本次付费金额超过规定上限，无法购买。请适度娱乐，理性消费。', '2020-08-18 18:19:28'),
(4, 1, 4, 1, '健康消费提示', '根据国家相关规定，当前您无法使用充值相关功能。', '2020-07-23 15:49:40'),
(5, 1, 4, 2, '健康消费提示', '根据国家相关规定，您当月的剩余可用充值额度不足，无法购买此商品。请适度娱乐，理性消费。', '2020-07-23 15:49:41'),
(6, 1, 4, 3, '健康消费提示', '根据国家相关规定，您当月的剩余可用充值额度不足，无法购买此商品。请适度娱乐，理性消费。', '2020-07-23 15:49:42'),
(7, 2, 3, 1, '健康消费提示', '当前账号未满 8 周岁，无法使用充值相关功能。根据国家相关规定，未满8周岁：不提供付费服务；8-16周岁以下：单笔付费不超过50元，每月累计不超过200元；16-18周岁以下：单笔付费不超过100元，每月累计不超过400元。', '2020-07-23 15:49:37'),
(8, 2, 3, 2, '健康消费提示', '当前账号未满 16 周岁，本次单笔付费金额超过规定上限 50 元，无法购买。根据国家相关规定，未满8周岁：不提供付费服务；8-16周岁以下：单笔付费不超过50元，每月累计不超过200元；16-18周岁以下：单笔付费不超过100元，每月累计不超过400元。', '2020-07-23 15:49:38'),
(9, 2, 3, 3, '健康消费提示', '当前账号未满 18 周岁，本次单笔付费金额超过规定上限 100 元，无法购买。根据国家相关规定，未满8周岁：不提供付费服务；8-16周岁以下：单笔付费不超过50元，每月累计不超过200元；16-18周岁以下：单笔付费不超过100元，每月累计不超过400元。', '2020-07-23 15:49:39'),
(10, 2, 4, 1, '健康消费提示', '当前账号未满 8 周岁，无法使用充值相关功能。根据国家相关规定，未满8周岁：不提供付费服务；8-16周岁以下：单笔付费不超过50元，每月累计不超过200元；16-18周岁以下：单笔付费不超过100元，每月累计不超过400元。', '2020-07-23 15:49:40'),
(11, 2, 4, 2, '健康消费提示', '当前账号未满 16 周岁，购买此商品后，您当月交易的累计总额已达上限  200 元，无法购买。根据国家相关规定，未满8周岁：不提供付费服务；8-16周岁以下：单笔付费不超过50元，每月累计不超过200元；16-18周岁以下：单笔付费不超过100元，每月累计不超过400元。', '2020-07-23 15:49:41'),
(12, 2, 4, 3, '健康消费提示', '当前账号未满 18 周岁，购买此商品后，您当月交易的累计总额已达上限  400 元，无法购买。根据国家相关规定，未满8周岁：不提供付费服务；8-16周岁以下：单笔付费不超过50元，每月累计不超过200元；16-18周岁以下：单笔付费不超过100元，每月累计不超过400元。', '2020-07-23 15:49:42'),
(13, 1, 1, 1, '健康游戏提示', '距离健康保护时间还剩余# ${remaining} #分钟，请注意适度游戏。', '2021-02-25 11:01:54'),
(14, 1, 5, 1, '健康游戏提示', '您当前为未成年账号，已被纳入防沉迷系统。根据国家相关规定，周五、周六、周日及法定节假日 20 点 -  21 点之外为健康保护时段。当前时间段无法游玩，请合理安排时间。', '2021-08-31 15:23:18'),
(15, 2, 1, 5, '健康游戏提示', '距离健康保护时间还剩余# ${remaining} #分钟，请注意适度游戏。', '2021-02-25 11:02:00'),
(16, 2, 1, 1, '健康游戏提示', '距离健康保护时间还剩余# ${remaining} #分钟，请注意适度游戏。', '2021-02-25 11:02:05'),
(17, 2, 1, 0, '健康游戏提示', '距离健康保护时间还剩余# ${remaining} #分钟，请注意适度游戏。', '2021-02-25 11:02:11'),
(18, 2, 5, 5, '健康游戏提示', '您的账号未完成实名认证，为了符合国家相关规定，不影响您的游戏体验，请尽快完善实名信息。', '2021-08-31 19:16:27'),
(19, 2, 5, 1, '健康游戏提示', '您当前为未成年账号，已被纳入防沉迷系统。根据国家相关规定，周五、周六、周日及法定节假日 20 点 -  21 点之外为健康保护时段。当前时间段无法游玩，请合理安排时间。', '2021-08-31 15:30:51'),
(20, 2, 5, 0, '健康游戏提示', '您的账号未完成实名认证，为了符合国家相关规定，不影响您的游戏体验，请尽快完善实名信息。', '2021-08-31 19:16:32'),
(21, 1, 2, 5, '健康游戏提示', '您的游戏体验时间还剩余# ${remaining} #分钟，登记实名信息后可深度体验。', '2020-08-04 11:15:14'),
(22, 1, 2, 1, '健康游戏提示', '您今日游戏时间还剩余# ${remaining} #分钟，请注意适度游戏。', '2021-02-25 11:02:16'),
(23, 1, 2, 0, '健康游戏提示', '您的游戏体验时间还剩余# ${remaining} #分钟，登记实名信息后可深度体验。', '2020-08-04 11:15:16'),
(24, 2, 2, 0, '健康游戏提示', '您的账号未完成实名认证，为了符合国家相关规定，不影响您的游戏体验，请尽快完善实名信息。', '2021-08-31 20:49:26'),
(25, 2, 2, 1, '健康游戏提示', '您当前为未成年账号，已被纳入防沉迷系统。根据国家相关规定，未成年账号非法定节假日每日游戏时长 1.5 小时，法定节假日每日游戏时长为 3 小时，且每日 22 点 - 次日 8 点为健康保护时段，不可进入游戏。该账号游戏体验时间还剩余# ${remaining} #分钟，请注意适度游戏。', '2021-02-25 11:02:22'),
(26, 2, 2, 5, '健康游戏提示', '您当前未提交实名信息，已被纳入防沉迷系统。您享有 60 分钟游戏体验时间，且每日 22 点 - 次日 8 点为健康保护时段，不可进入游戏。该账号游戏体验时间还剩余# ${remaining} #分钟。', '2020-08-04 17:22:50'),
(27, 1, 6, 5, '健康游戏提示', '您的账号未完成实名认证，为了符合国家相关规定，不影响您的游戏体验，请尽快完善实名信息。', '2021-08-31 20:38:19'),
(28, 1, 6, 1, '健康游戏提示', '您今日游戏时间已达# ${remaining} #分钟。根据国家相关规定，今日无法再进行游戏，请注意适度游戏。', '2021-02-25 11:02:26'),
(29, 1, 6, 0, '健康游戏提示', '您的账号未完成实名认证，为了符合国家相关规定，不影响您的游戏体验，请尽快完善实名信息。', '2021-08-31 20:48:45'),
(30, 2, 6, 5, '健康游戏提示', '您的账号未完成实名认证，为了符合国家相关规定，不影响您的游戏体验，请尽快完善实名信息。', '2021-08-31 20:47:33'),
(31, 2, 6, 1, '健康游戏提示', '您当前为未成年账号，已被纳入防沉迷系统。根据国家相关规定，未成年账号非法定节假日每日游戏时长 1.5 小时，法定节假日每日游戏时长为 3 小时，且每日 22 点 - 次日 8 点为健康保护时段，不可进入游戏。该账号游戏体验时间已达# ${remaining} #分钟上限，无法再进行游戏。', '2020-09-15 17:49:04'),
(32, 2, 6, 0, '健康游戏提示', '您的账号未完成实名认证，为了符合国家相关规定，不影响您的游戏体验，请尽快完善实名信息。', '2021-08-31 20:49:30'),
(33, 1, 7, 0, '健康游戏提示', '您的账号未完成实名认证，为了符合国家相关规定，不影响您的游戏体验，请尽快完善实名信息。', '2021-08-31 20:48:48'),
(34, 1, 8, 0, '健康游戏提示', '您的账号未完成实名认证，为了符合国家相关规定，不影响您的游戏体验，请尽快完善实名信息。', '2021-08-31 20:48:53'),
(35, 1, 9, 0, '健康游戏提示', '您的账号未完成实名认证，为了符合国家相关规定，不影响您的游戏体验，请尽快完善实名信息。', '2021-08-31 20:48:57'),
(36, 2, 7, 0, '健康游戏提示', '您的账号未完成实名认证，为了符合国家相关规定，不影响您的游戏体验，请尽快完善实名信息。', '2021-08-31 20:49:35'),
(37, 2, 8, 0, '健康游戏提示', '您的账号未完成实名认证，为了符合国家相关规定，不影响您的游戏体验，请尽快完善实名信息。', '2021-08-31 20:49:38'),
(38, 2, 9, 0, '健康游戏提示', '您的账号未完成实名认证，为了符合国家相关规定，不影响您的游戏体验，请尽快完善实名信息。', '2021-08-31 20:49:40'),
(39, 2, 10, 0, '健康游戏提示', '您的账号未完成实名认证，为了符合国家相关规定，不影响您的游戏体验，请尽快完善实名信息。', '2021-08-31 14:58:23'),
(40, 1, 7, 5, '健康游戏提示', '您的账号未完成实名认证，为了符合国家相关规定，不影响您的游戏体验，请尽快完善实名信息。', '2021-08-31 20:46:04'),
(41, 1, 8, 5, '健康游戏提示', '您当前未提交实名信息，游戏体验时间还剩余# ${remaining} #分钟。登记实名信息后可深度体验。', '2020-08-06 17:20:02'),
(42, 1, 9, 5, '健康游戏提示', '您的账号未完成实名认证，为了符合国家相关规定，不影响您的游戏体验，请尽快完善实名信息。', '2021-08-31 20:33:36'),
(43, 2, 7, 5, '健康游戏提示', '您的账号未完成实名认证，为了符合国家相关规定，不影响您的游戏体验，请尽快完善实名信息。', '2021-08-31 20:47:26'),
(44, 2, 8, 5, '健康游戏提示', '您的账号未完成实名认证，为了符合国家相关规定，不影响您的游戏体验，请尽快完善实名信息。', '2021-08-31 20:47:40'),
(45, 2, 9, 5, '健康游戏提示', '您的账号未完成实名认证，为了符合国家相关规定，不影响您的游戏体验，请尽快完善实名信息。', '2021-08-31 20:47:53'),
(46, 2, 10, 5, '健康游戏提示', '您的账号未完成实名认证，为了符合国家相关规定，不影响您的游戏体验，请尽快完善实名信息。', '2021-08-31 14:54:26'),
(47, 1, 9, 1, '健康游戏提示', '您今日游戏时间已达# ${remaining} #分钟。根据国家相关规定，今日无法再进行游戏。请注意适度游戏。', '2021-02-25 11:02:33'),
(48, 1, 11, 1, '健康游戏提示', '您今日游戏时间还剩余# ${remaining} #分钟，请注意适度游戏。', '2021-02-25 11:02:42'),
(49, 2, 7, 1, '健康游戏提示', '您当前为未成年账号，已被纳入防沉迷系统。根据国家相关规定，未成年账号非法定节假日每日游戏时长 1.5 小时，法定节假日每日游戏时长为 3 小时，且每日 22 点 - 次日 8 点为健康保护时段，不可进入游戏。您当前享有# ${remaining} #分钟游戏时间，请注意适度游戏。', '2021-02-25 11:02:58'),
(50, 2, 8, 1, '健康游戏提示', '您当前为未成年账号，已被纳入防沉迷系统。根据国家相关规定，未成年账号非法定节假日每日游戏时长 1.5 小时，法定节假日每日游戏时长为 3 小时，且每日 22 点 - 次日 8 点为健康保护时段，不可进入游戏。该账号游戏体验时间还剩余# ${remaining} #分钟，请注意适度游戏。', '2021-02-25 11:03:05'),
(51, 2, 9, 1, '健康游戏提示', '您当前为未成年账号，已被纳入防沉迷系统。根据国家相关规定，未成年账号非法定节假日每日游戏时长 1.5 小时，法定节假日每日游戏时长为 3 小时，且每日 22 点 - 次日 8 点为健康保护时段，不可进入游戏。该账号游戏体验时间已达# ${remaining} #分钟上限，无法再进行游戏。', '2020-09-15 17:49:29'),
(52, 2, 10, 1, '健康游戏提示', '您当前为未成年账号，已被纳入防沉迷系统。根据国家相关规定，每日 22 点 - 次日 8 点为健康保护时段，当前不可进入游戏。', '2020-08-06 17:20:02'),
(53, 2, 11, 1, '健康游戏提示', '您今日游戏时间还剩余# ${remaining} #分钟，请注意适度游戏。', '2021-02-25 11:03:10'),
(54, 1, 12, 0, '健康游戏提示', '您的游戏体验时间还剩余# ${remaining} #分钟，登记实名信息后可深度体验。', '2020-07-31 10:32:56'),
(55, 2, 12, 0, '健康游戏提示', '您的游戏体验时间还剩余# ${remaining} #分钟，登记实名信息后可深度体验。', '2020-07-31 10:32:56'),
(56, 1, 12, 5, '健康游戏提示', '您的游戏体验时间还剩余# ${remaining} #分钟，登记实名信息后可深度体验。', '2020-07-31 10:32:56'),
(57, 2, 12, 5, '健康游戏提示', '您的游戏体验时间还剩余# ${remaining} #分钟，登记实名信息后可深度体验。', '2020-07-31 10:32:56'),
(58, 1, 12, 1, '健康游戏提示', '您今日游戏时间还剩余# ${remaining} #分钟，请注意适度游戏。', '2021-02-25 11:03:16'),
(59, 2, 12, 1, '健康游戏提示', '您今日游戏时间还剩余# ${remaining} #分钟，请注意适度游戏。', '2021-02-25 11:03:25'),
(60, 1, 13, 0, '健康游戏提示', '距离健康保护时间还剩余# ${remaining} #分钟，请注意适度游戏。', '2021-02-25 11:03:30'),
(61, 2, 13, 0, '健康游戏提示', '距离健康保护时间还剩余# ${remaining} #分钟，请注意适度游戏。', '2021-02-25 11:03:34'),
(62, 1, 13, 5, '健康游戏提示', '距离健康保护时间还剩余# ${remaining} #分钟，请注意适度游戏。', '2021-02-25 11:03:37'),
(63, 2, 13, 5, '健康游戏提示', '距离健康保护时间还剩余# ${remaining} #分钟，请注意适度游戏。', '2021-02-25 11:03:41'),
(64, 1, 13, 1, '健康游戏提示', '距离健康保护时间还剩余# ${remaining} #分钟，请注意适度游戏。', '2021-02-25 11:03:45'),
(65, 2, 13, 1, '健康游戏提示', '距离健康保护时间还剩余# ${remaining} #分钟，请注意适度游戏。', '2021-02-25 11:03:49'),
(66, 1, 10, 5, '健康游戏提示', '您的账号未完成实名认证，为了符合国家相关规定，不影响您的游戏体验，请尽快完善实名信息。', '2021-08-31 14:46:32'),
(67, 1, 10, 0, '健康游戏提示', '您的账号未完成实名认证，为了符合国家相关规定，不影响您的游戏体验，请尽快完善实名信息。', '2021-08-31 14:59:43'),
(68, 1, 5, 5, '健康游戏提示', '您的账号未完成实名认证，为了符合国家相关规定，不影响您的游戏体验，请尽快完善实名信息。', '2021-08-31 20:17:30');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `fcm_ui_config`
--
ALTER TABLE `fcm_ui_config`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `fcm_ui_config_group_type_account_type` (`group`,`type`,`account_type`),
  ADD KEY `type_index` (`type`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `fcm_ui_config`
--
ALTER TABLE `fcm_ui_config`
  MODIFY `id` int(10) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=69;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
